# Pandas

In [206]:
import pandas as pd

## Series

In [207]:
series = pd.Series(["하나", "둘", "셋", "넷", "다섯",
                    "여섯", "일곱", "여덟", "아홉", "열"],
                   index = [_ for _ in range(1, 11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [208]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [209]:
# index를 지정하지 않은 경우
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [210]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [211]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [212]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [213]:
# dict를 사용해 만들어보기
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [214]:
# dict의 key와 Series 객체의 index를 다르게 설정

d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['x', 'y', 'z'])
ser

x   NaN
y   NaN
z   NaN
dtype: float64

In [215]:
# index 지정 없이 dict 객체만 가지고 만들 수 도 있다.

s2 = pd.Series({"서울":9_904_312,
                "부산":3_448_737,
                "인천":2_890_451,
                "대구":2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [216]:
# label 값이 영문 문자열인 경우에는
# index label이 속성인 것처럼 마침표를 활용해 index에 접근 가능

d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser.a, ser.b, ser.c

(1, 2, 3)

In [217]:
"서울" in s

True

In [218]:
"대전" in s

False

In [219]:
for k, v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [101]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [102]:
s / 100000

도시
서울    99.04312
부산    34.48737
인천    28.90451
대구    24.66052
Name: 인구, dtype: float64

In [103]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [104]:
s[1], s["부산"]

(3448737, 3448737)

In [105]:
s[3], s["대구"]

(2466052, 2466052)

In [106]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [107]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [108]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [109]:
# 문자열로 슬라이싱 할경우 : 뒤에 값도 나온다
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [110]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [111]:
s2 = pd.Series({"서울":9631482,
                "부산":3393191,
                "인천":2632035,
                "대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [112]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [113]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [114]:
# NaN 값 빼고 시리즈 객체 만드는 법
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [115]:
# 2010년 대비 2015년 인구 증가율
# s # 2015년 도시별 인구
# s2 # 2010년 도시별 인구

rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [116]:
# 인덱스를 사용해 데이터를 추가하거나 갱신 가능
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [117]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [118]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [119]:
# 연습 문제
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, fin2_index)

In [120]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [121]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [122]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [123]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [124]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

## DataFrame

In [125]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [126]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [127]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [128]:
pl_data = {
    "팀명": ["아스날", "맨체스터 시티", "뉴캐슬 유나이티드", "맨체스터 유나이티드"],
    "경기": [18, 18, 19, 18],
    "승": [15, 12, 10, 12],
    "무": [2, 3, 8, 2],
    "패": [1, 3, 1, 4],
    "승점": [47, 39, 38, 38],
    "경기당 승점": [47/18, 39/18, 38/19, 38/18]
}

pl_columns = ["팀명", "경기", "승", "무", "패", "승점", "경기당 승점"]
pl_index = [_ for _ in range(1, 5)]

pl_df = pd.DataFrame(pl_data, index=pl_index, columns=pl_columns)
pl_df

           팀명  경기   승  무  패  승점    경기당 승점
1         아스날  18  15  2  1  47  2.611111
2     맨체스터 시티  18  12  3  3  39  2.166667
3   뉴캐슬 유나이티드  19  10  8  1  38  2.000000
4  맨체스터 유나이티드  18  12  2  4  38  2.111111

In [129]:
# "2005~2010 증가율 이라는 이름의 열 추가"
df["2005~2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005~2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283          -1.34
부산  경상권  3448737  3393191  3512547  3655437         0.0163          -3.40
인천  수도권  2890451  2632035  2517680  2466338         0.0982           4.54
대구  경상권  2466052  2431774  2456016  2473990         0.0141          -0.99

In [130]:
# 하나의 column만 인덱싱하면 Series가 반환된다.
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [131]:
# Series 형태로 반환
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [132]:
# 배열 또는 리스트로 인덱싱하면 DataFrame 타입이 반환
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [133]:
# column을 반환하면서 DataFrame 자료형을 유지
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [134]:
import numpy as np

df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [135]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [136]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

In [137]:
df[:1] # df[:"서울"]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005~2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283          -1.34

In [138]:
# row가 부산인 결과만 보고 싶을 경우
df[1:2]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005~2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163           -3.4

In [139]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005~2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163           -3.4

In [140]:
df["2015"]

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [141]:
df["2015"]["서울"]

9904312

In [142]:
type(df["2015"]["서울"])

numpy.int64

In [143]:
# 연습문제
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

# print(df)
# 1 모든 학생의 수학 점수를 Series로 나타낸다.
print(df["수학"])
# 2 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
print(df[["국어", "영어"]])
# 3 모든 학생의 각 과목 평균 점수를 새로운 열로 추가
df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3)
# print(df)
# 4 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산
df["영어"]["방자"] = 80
df["평균 점수"]["방자"] = ((df["국어"]["방자"] + df["영어"]["방자"] + df["수학"]["방자"]) / 3)
# 5 춘향의 점수를 데이터 프레임으로 나타낸다
print(df["춘향":"춘향"])
# 6 향단의 점수를 Series로 나타낸다.
df.T["향단"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64
    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40
    국어  영어  수학      평균 점수
춘향  80  90  90  86.666667

/var/folders/p4/ybhgl5113q57lp0vhqc2znhr0000gn/T/ipykernel_38586/3307547473.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80
/var/folders/p4/ybhgl5113q57lp0vhqc2znhr0000gn/T/ipykernel_38586/3307547473.py:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["평균 점수"]["방자"] = ((df["국어"]["방자"] + df["영어"]["방자"] + df["수학"]["방자"]) / 3)

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [144]:
# 연습문제
np.random.seed(0)
index = pd.date_range("20130226",periods=6)
columns = ["A", "B", "C", "D"]
data = np.random.randn(6, 4)

df = pd.DataFrame(data, index=index, columns=columns)
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

# python day 12
## to_csv()
## read_csv()

In [145]:
import pandas as pd
# columns = ["c1", "c2", "c3"]
# index = [0, 1, 2]
data = {
    "c1": [1, 2, "누락"],
    "c2": [1.11, "", 3.33],
    "c3": ["one", "two", "three"]
}
# df = pd.DataFrame(data, index=index, columns=columns)
df_csv = pd.DataFrame(data)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [146]:
df_csv.to_csv("sample1.csv", index=False)

In [147]:
df_read = pd.read_csv("sample1.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [148]:
# column 인덱스를 배제하고 저장해보기 header=False 사용
df_csv.to_csv("sample2.csv", index=False, header=False)

In [149]:
# column 인덱스가 없는 데이터를 다시 불러올때, columnn 인덱스 정보를 직접 추가할 수 있다.
pd.read_csv('sample2.csv', names=['c1', 'c2', 'c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [150]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting sample3.txt

In [151]:
# 읽어오려는 파일의 구분자가 ,가 아닌 경우 구분자를 지정해줘야 한다.
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [152]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [153]:
# 상단에 부가적인 텍스트가 있는 경우
pd.read_csv('sample4.txt', skiprows=[0, 1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [154]:
# 불러올 자료 안의 특정한 값을 NaN으로 취급하고 싶으면, na_values를 이용
df_na_val = pd.read_csv("sample1.csv", na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [155]:
# 출력할 때도 sep 인수로 구분자를 바꿀 수 있다.
df_na_val.to_csv('sample5.txt', sep='|')

In [156]:
# 저장할 때도 na_rep을 이용해 NaN 표시값을 바꿀 수 있다.
# NaN 값을 '누락'으로 변경해서 저장
df_na_val.to_csv('sample6.csv', na_rep='누락')

## 온라인의 데이터 불러오기

In [157]:
# titanic 데이터 불러오기
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [158]:
titanic.head()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

In [159]:
titanic.tail()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
622,0,male,28.0,0,0,10.50,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.05,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.00,First,B,Southampton,y
625,0,female,28.0,1,2,23.45,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.75,Third,unknown,Queenstown,y

In [160]:
import numpy as np
data = np.arange(10, 22).reshape(3, 4)
df = pd.DataFrame(data, index=['a', 'b', 'c'], columns=['A', 'B', 'C', 'D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [161]:
# loc 인덱서를 사용하며 콤마 없이 하나만 넣으면 row를 선택, Series로 반환
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [162]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [163]:
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [164]:
# 리스트 형태로 인덱싱도 가능
df.loc[["b", "c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [165]:
# Boolean 시리즈로 인덱싱도 가능
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [166]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [167]:
# callable한 함수를 만들어서 인덱싱하는데 사용할 수 있다.
def select_rows(df, num):
    return df.A > num
select_rows(df, 10)

a    False
b     True
c     True
Name: A, dtype: bool

In [168]:
df.loc[select_rows(df, 10)]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [169]:
# row 인덱스 값이 default로 주어진 정수로 생성된 DF의 경우에는
# 슬라이싱 마지막 숫자가 포함된 결과를 가져온다.
# 원래 row 인덱스 값이 정ㅇ수인 경우에는 마지막 값이 포함된다.
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [170]:
# row 인덱스 값이 default로 주어진 정수로 생성된 DF의 경우에는
# 슬라이싱 마지막 숫자가 포함된 결과를 가져온다.
df2.loc[1:3]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [171]:
# iloc은 loc과 다르게 label 인덱스가 아닌 숫자로된 인덱스에 접근하기에 우리가 아는 슬라이싱 방식과 동일하게 포함하지 않음
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [172]:
df.iloc[1:2]

    A   B   C   D
b  14  15  16  17

In [173]:
# 인덱싱 값을 row와 column 모두 받으려면 df.loc[row 인덱스, column 인덱스]와 같은 형태로 사용
df.loc["a", "A"]

10

In [174]:
# 콤마로 구분된 인덱싱 값으로 슬라이싱 또는 리스트도 사용 가능
df.loc["b":,"A"]

b    14
c    18
Name: A, dtype: int64

In [175]:
df.loc["a",:]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [176]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [177]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [178]:
# iloc은 label이 아니라 정수 인덱스만 받음, 다른건 loc과 같음
df.iloc[0, 1]

11

In [179]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int64

In [180]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int64

In [181]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [182]:
# loc 인덱서와 마찬가지로 인덱스가 하나만 들어가면 행을 선택
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int64

In [183]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

## Series 데이터 개수 세기

In [184]:
# count() 메소드를 사용하면 NaN값은 세지 않음
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [185]:
s.count()

9

In [186]:
len(s)

10

## DataFrame 데이터 개수 세기

In [187]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [188]:
# dataFrame에서는 각 열마다의 데이터 개수를 센다
# NaN 값을 제외하고 개수를 센다.
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [189]:
# seaborn 패키지는 여러가지 데이터를 제공하고 있다.
# 위에서 사용한 타이타닉 승객 데이터도 있다.
# DataFrame으로 읽어올 수 있다.
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [190]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## Series 카테고리 값 세기

In [191]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100)) # 0 ~ 5 사이의 정수를 100회 생성
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int64

In [192]:
s2.value_counts() # series 객체 내에 인덱스별로 나온 횟수를 보여줌

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [193]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [194]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

## Series 정렬

In [195]:
# index 순으로 정렬하려면 sort_index()를, value 기준으로 정렬하려면 sort_values()
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [196]:
# 위 셀의 반환값에 sort_index를 적용하면 정렬된 결과가 나옴
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [197]:
# value를 기준으로 정렬하면 NaN값이 있을 경우 가장 나중으로 위치함
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [198]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [199]:
# ascending=False을 활용해 내림차순도 가능!
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

## DataFrame 정렬

In [200]:
# df에서 sort_values를 사용하려면 by 키워드 인수를 사용해야 한다.
# 정렬 기준이 되는 column을 지정해줘야한다.
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [201]:
# 리스트 자료형의 형태로 지정하면 요소의 순서대로 정렬 기준의 우선순위가 된다.
# 첫번째 열을 기준으로 정렬한 후, 동일한 순서 값이 나오면 그 다음 기준으로 순서를 결정
df.sort_values(by=[1, 2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [202]:
print(titanic.value_counts('sex').sort_values(ascending=False))
print(titanic.value_counts('age').sort_values(ascending=False))
print(titanic.value_counts('class').sort_values(ascending=False))
print(titanic.value_counts('alive').sort_values(ascending=False))

sex
male      577
female    314
dtype: int64
age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
0.42      1
66.00     1
70.50     1
74.00     1
80.00     1
Length: 88, dtype: int64
class
Third     491
First     216
Second    184
dtype: int64
alive
no     549
yes    342
dtype: int64

In [86]:
# 원래는 이렇게 pandas 1.1 이전 버전에서
titanic['sex'].value_counts().sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [203]:
pd.__version__

'1.4.4'

In [204]:
titanic.value_counts(["sex", "age", "class", "alive"])

sex     age   class   alive
male    22.0  Third   no       13
        21.0  Third   no       12
        19.0  Third   no       11
        28.0  Third   no       10
        20.0  Third   no       10
                               ..
female  32.0  Second  yes       1
              First   yes       1
male    27.0  First   no        1
female  31.0  Second  yes       1
male    80.0  First   yes       1
Length: 339, dtype: int64

In [205]:
titanic.value_counts(["sex"])

sex
male      577
female    314
dtype: int64

## DataFrame 행/열 합계

In [220]:
# row와 column의 합계를 구할 때는 sum(axis)를 사용
# axis는 없어지는 방향축을 지정
# row의 집계를 구할 때는 sum(axis=1) 사용
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [221]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [222]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [223]:
# column의 합계를 구할 때는 sum(axis=0) 사용, axis의 디폴트 값이 0이므로 axis 인수 생략가능
df2.sum()

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [224]:
df2.loc["ColTotal2"] = df2.sum()
df2

            0   1   2   3   4   5  6   7  RowSum
0           5   8   9   5   0   0  1   7      35
1           6   9   2   4   5   2  4   2      34
2           4   7   7   9   1   7  0   6      41
3           9   9   7   6   9   1  0   1      42
ColTotal2  24  33  25  24  15  10  5  16     152

In [225]:
# mean() 메서드는 평균을 구하며 앞서 설명한 sum() 메서드와 사용법이 같다. sum처럼 axis 지정
df2.mean()

0          9.6
1         13.2
2         10.0
3          9.6
4          6.0
5          4.0
6          2.0
7          6.4
RowSum    60.8
dtype: float64

In [226]:
df2.loc["ColTotal", :] = df.mean()
df2

              0      1      2          3     4     5    6     7  RowSum
0           5.0   8.00   9.00   5.000000   0.0   0.0  1.0   7.0    35.0
1           6.0   9.00   2.00   4.000000   5.0   2.0  4.0   2.0    34.0
2           4.0   7.00   7.00   9.000000   1.0   7.0  0.0   6.0    41.0
3           9.0   9.00   7.00   6.000000   9.0   1.0  0.0   1.0    42.0
ColTotal2  24.0  33.00  25.00  24.000000  15.0  10.0  5.0  16.0   152.0
ColTotal    2.5   1.25   3.25   1.666667   NaN   NaN  NaN   NaN     NaN

In [227]:
titanic["age"].mean()

29.69911764705882

In [232]:
titanic[titanic.sex == "female"]["age"].mean()

27.915708812260537

In [237]:
tmp = titanic[titanic.pclass == 1]
tmp[tmp.sex == "female"]["age"].mean()

34.61176470588235

In [239]:
# 타이타닉 승객의 평균 나이
print(titanic["age"].mean())

# 타이타닉호 승객중 여성 승객의 평균 나이
print(titanic[titanic.sex == "female"]["age"].mean())

# 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이
tmp = titanic[titanic.pclass == 1]
print(tmp[tmp.sex == "female"]["age"].mean())

29.69911764705882
27.915708812260537
34.61176470588235

In [241]:
titanic[titanic.age == 20]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
91,0,3,male,20.0,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
113,0,3,female,20.0,1,0,9.8250,S,Third,woman,False,NaN,Southampton,no,False
131,0,3,male,20.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
378,0,3,male,20.0,0,0,4.0125,C,Third,man,True,NaN,Cherbourg,no,True
404,0,3,female,20.0,0,0,8.6625,S,Third,woman,False,NaN,Southampton,no,True
441,0,3,male,20.0,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
622,1,3,male,20.0,1,1,15.7417,C,Third,man,True,NaN,Cherbourg,yes,False
640,0,3,male,20.0,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
664,1,3,male,20.0,1,0,7.9250,S,Third,man,True,NaN,Southampton,yes,False
682,0,3,male,20.0,0,0,9.2250,S,Third,man,True,NaN,Southampton,no,True
725,0,3,male,20.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
762,1,3,male,20.0,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
840,0,3,male,20.0,0,0,7.9250,S,Third,man,True,NaN,Southampton,no,True
876,0,3,male,20.0,0,0,9.8458,S,Third,man,True,NaN,Southampton,no,True

In [242]:
[titanic.age == 20]

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: age, Length: 891, dtype: bool

## python day 13
### 데이터프레임에 함수 적용하기

In [6]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[4, 9]] * 3, columns=["A", "B"])
df

   A  B
0  4  9
1  4  9
2  4  9

In [7]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [8]:
np.sqrt(df)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [9]:
# axis가 0일때 각 column별 집계
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [10]:
# axis가 1일 때 각 row별 집계
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [11]:
df.apply(lambda x: [1, 2], axis=0)

   A  B
0  1  1
1  2  2

In [12]:
df.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [13]:
# result_type = broadcast를 인수로 전달하면 동일한 shape의 결과를 보장
df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')

   A  B
0  1  2
1  1  2
2  1  2

In [14]:
# column마다의 최대값과 최소값의 차이를 구하고 싶으면 다음과 같은 lambda 함수를 사용

df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [15]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [16]:
# row에 대해 적용하고 싶으면 axis=1 인수를 사용
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [18]:
# 앞에서 배웠던 value_counts도 사용 가능
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [47]:
# 타이타닉호의 승객 중 나이 20살을 기준으로 성인과 미성년자를 구별하는 칼럼 생성가능
import seaborn as sns

titanic = sns.load_dataset("titanic")

titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)

titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [49]:
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [55]:
# NaN값을 원하는 값으로 바꾸는 fillna() 메소드
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [1, 2, 3, 4]], columns=list("ABCD"))
df

     A    B    C    D
0  NaN  2.0  NaN  0.0
1  3.0  4.0  NaN  1.0
2  NaN  NaN  NaN  NaN
3  1.0  2.0  3.0  4.0

In [56]:
df.fillna(0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  1.0  2.0  3.0  4.0

In [57]:
# fillna() value값으로 column label을 key로 갖는 딕셔너리를 전달할 수 있다.
# 그러면 column마다 NaN을 대치하는 값을 각각 다르게 지정가능.
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  1.0  2.0  3.0  4.0

In [58]:
# fillna()에 limit 키워드 인자에 숫자르 전달해 그 숫자만큼 column마다 변경 횟수를 제한할 수 있다.
df.fillna(value=values, limit=1)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  NaN  1.0
2  NaN  1.0  NaN  3.0
3  1.0  2.0  3.0  4.0

In [60]:
# fillna()에 DataFrame을 value로 전달해 NaN값을 대체 가능
# column label과 row index가 일치하지 않으면 적용되지 않음
df2 = pd.DataFrame(np.zeros((3, 4)), columns=list("ABCE"))
df.fillna(df2)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  1.0  2.0  3.0  4.0

In [61]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic DataFrame을 고쳐라
# isna()를 써서 NaN값인 것을 찾을 수 있다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
adult/child    891
category1      891
dtype: int64

In [82]:
nan_index = titanic.age.isna()
nan_index

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: age, Length: 891, dtype: bool

In [83]:
titanic.age[nan_index]

Series([], Name: age, dtype: float64)

In [68]:
titanic.age.mean()

29.69911764705882

In [81]:
# fillna(inplace=True)로 하면 대입을 하지 않아도 값이 대체됨
titanic.age = titanic.age.fillna(titanic.age.mean())

In [84]:
# 강사님 방법
index_age_is_nan = titanic[titanic['age'].isna()].index
print(index_age_is_nan)

Int64Index([], dtype='int64')

In [85]:
titanic.fillna({'age': round(titanic['age'].mean(), 1)}, inplace=True)

In [86]:
titanic.iloc[index_age_is_nan]

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone, adult/child, category1]
Index: []

In [87]:
# astype() 메소드
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(d)
df.dtypes

col1    int64
col2    int64
dtype: object

In [88]:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [89]:
# dtype을 dictionary로 전달하면 해당 column만 형변환 가능
df.astype({'col1': 'int32'}).dtypes

col1    int32
col2    int64
dtype: object

In [119]:
titanic["category2"] = titanic.apply(lambda x: x.sex + str(x.age), axis=1)
# 강사님 풀이
titanic["category2"] = titanic.sex + titanic.age.astype(str)
titanic[['age', 'category2']]

           age                category2
0    22.000000                 male22.0
1    38.000000               female38.0
2    26.000000               female26.0
3    35.000000               female35.0
4    35.000000                 male35.0
..         ...                      ...
886  27.000000                 male27.0
887  19.000000               female19.0
888  29.699118  female29.69911764705882
889  26.000000                 male26.0
890  32.000000                 male32.0

[891 rows x 2 columns]

In [122]:
type(titanic["sex"])

pandas.core.series.Series

In [123]:
type(titanic.sex)

pandas.core.series.Series

In [116]:
type(titanic.astype({'age' : 'str'}).age)

pandas.core.series.Series

### DataFrame 실수 값을 카테고리 값으로 변환

In [124]:
# cut: 실수 값의 경계선을 지정하는 경우
# qcut: 개수가 똑같은 구간으로 나누는 경우

ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '중년', '미성년자', '장년', '장년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [125]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [126]:
cats.categories

Index(['미성년자', '청년', '장년', '중년', '노년'], dtype='object')

In [127]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [139]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels = labels)
df4.dtypes
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      장년
7     61      중년
8     20    미성년자
9     41      장년
10    32      장년
11   101     NaN

In [138]:
df4["age_cat"].astype(str) + df4["ages"].astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       장년37
6       장년31
7       중년61
8     미성년자20
9       장년41
10      장년32
11    nan101
dtype: object

In [136]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
cats

['Q1', 'Q4', 'Q1', 'Q3', 'Q2', ..., 'Q4', 'Q4', 'Q1', 'Q2', 'Q4']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [140]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

In [153]:
pd.value_counts(pd.cut(titanic.age, bins, labels = labels))[0] / len(titanic.age)
pd.value_counts(pd.cut(titanic.age, bins, labels = labels))[1] / len(titanic.age)
pd.value_counts(pd.cut(titanic.age, bins, labels = labels))[2] / len(titanic.age)
pd.value_counts(pd.cut(titanic.age, bins, labels = labels))[3] / len(titanic.age)
pd.value_counts(pd.cut(titanic.age, bins, labels = labels))[4] / len(titanic.age)

0.005611672278338945

In [145]:
len(titanic.age)

891

In [170]:
tmp = pd.value_counts(pd.cut(titanic.age, bins, labels = labels))
tmp/sum(tmp)

청년      0.464082
장년      0.274800
미성년자    0.188141
중년      0.067275
노년      0.005701
Name: age, dtype: float64

In [168]:
tmp

청년      407
장년      241
미성년자    165
중년       59
노년        5
Name: age, dtype: int64

In [172]:
pd.cut(titanic.age, bins, labels = labels)

0        청년
1        장년
2        청년
3        장년
4        장년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      장년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [195]:
titanic["category3"] = pd.cut(titanic.age, bins, labels = labels)
titanic["category3"] = titanic.apply(lambda r: r.sex + r.category3 if r.age > 20 else "미성년자", axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2,category3
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22.0,male청년
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38.0,female장년
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26.0,female청년
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female35.0,female장년
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male35.0,male장년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27.0,male청년
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,female19.0,미성년자
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,female,female29.69911764705882,female청년
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26.0,male청년
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32.0,male장년

In [196]:
"male" "mail"

'malemail'

In [200]:
# set_index: 기존의 row 인덱스를 제거하고 데이터 column 중 하나를 인덱스로 설정
# reset_index: 기존의 row 인덱스를 제거하고 인덱스를 데이터 열로 추가
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list("ABCDE"),
                   np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [201]:
df2 = df1.set_index("C1")
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [202]:
df2.set_index("C2")

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [216]:
np.random.seed(0)
df2 = pd.DataFrame(np.vstack([list("ABCDE"),
                   np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df2

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [204]:
df2.reset_index()

   index C1    C2    C3    C4
0      0  A  0.55  0.65  0.79
1      1  B  0.72  0.44  0.53
2      2  C   0.6  0.89  0.57
3      3  D  0.54  0.96  0.93
4      4  E  0.42  0.38  0.07

In [205]:
# reset_index() 인수 drop = True 인수로 전달하면 인덱스 column을 보통의 자료열로 올리는 것이 아니라 그냥 버리게 됨
df2.reset_index(drop=True)

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [214]:
score = {
    "이름":["일식", "이식", "삼식", "사식", "오식"],
    "국어":[60, 70, 90, 80, 100],
    "영어":[70, 86, 82, 88, 100],
    "수학":[65, 82, 85, 90, 100]
}

tmp = pd.DataFrame(score)
tmp.set_index("이름")
tmp.reset_index(drop=True)

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

In [218]:
# 다중 인덱스
np.random.seed(0)
df3 = pd.DataFrame(np.vstack([list("ABCDE"),
                   np.round(np.random.rand(3, 5), 2)]).T,
                   columns=[["A", "A", "B", "B"],["C1", "C2", "C3", "C4"]])
df3

   A           B
  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07